package HomeWork001;

public class Main {
    public static void main(String[] args) {
        /*
        Task-1:
            Задать одномерный массив и найти в нем минимальный и максимальный элементы.
        Task-2:
            Написать метод, который определяет, является ли год високосным, и возвращает
            boolean (високосный - true, не високосный - false). Каждый 4-й год является високосным,
            кроме каждого 100-го, при этом каждый 400-й – високосный.
        Task-3:
            Дан массив nums = [3,2,2,3] и число val = 3.
            Если в массиве есть числа, равные заданному, нужно перенести эти элементы в конец массива.
            Таким образом, первые несколько (или все) элементов массива должны быть отличны от заданного,
            а остальные - равны ему.
        */

    }
}
